{
    "documentation":"Dokumentation",
    "premium_support":"Premium-Support",
    "access_configuration":"Zugang",
    "technical_configuration":"Technisch",
    "api_key_configuration":"API-Schlüssel",
    "excluded_zones_title":"Ausgeschlossene Zonen",
    "excluded_zones_title_help":"Sie können ausgeschlossene Zonen definieren, in denen die Erweiterung im Warenkorb und in der Kasse keine Preise ermitteln soll. Dies kann nützlich sein, falls Sie eigene Versandoptionen in bestimmten Gegenden anbieten möchten. (z.B.indem Sie WooCommerce Versandzonen für diese Bereiche definieren)",
    "billing_account":"Rechnungskonto",
    "brand_name":"EnvíaYa",
    "title":"Titel",
    "enabled":"Aktiviert",
    "api_key":"API-Schlüssel",
    "api_key_help":"Sie können Ihren API-Schlüssel entweder in Ihrem Benutzerprofil auf der EnvíaYa-Seite finden oder auf den Link klicken, um Ihren  API-Schlüssel zu erhalten. ",
    "test_api_key":"Test-API-Schlüssel",
    "use_enviaya":"",
    "use_enviaya_help":"",
    "ship_to_countries":"Versende in die folgenden Länder",
    "all_countries":"Alle Länder",
    "specific_countries":"Nur bestimmte Länder ",
    "timeout":"Server-Zeitlimit (Timeout)",
    "timeout_help":"Dieser Wert bestimmte die maximale Zeitspanne, die Sie auf eine Antwort unserer API warten möchten. Nach dieser Zeitspanne wird ein Fehler zurückgegeben bzw. die Kontingenz-Sendungsprodukte werden auf der Kassenseite angezeigt. Wir empfehlen einen Wert von 30 Sekunden.",
    "enable_test_mode":"Testmodus aktivieren ",
    "test_mode_help":"Im Testmodus werden keine gültigen Sendungen erstellt oder fakturiert.",
    "no":"Nein",
    "yes":"Ja",
    "account":"Rechnungskonto",
    "rating_configuration":"Preisfindung",
    "enable_rating":"Preisermittlung aktivieren ",
    "rates_title":"Dies ist der Titel, der den Kunden während des Check-outs oben auf der Liste der Versandprodukte angezeigt wird. Sie können das Feld leer lassen, falls Sie keinen Titel anzeigen möchten.",
    "remove_rating_zones_hint":"Wir empfehlen alle Sendungszonen (Shipping Zones) zu entfernen und alle anderen Erweiterung für die Sendungspreisfindung zu deaktivieren, wenn Sie die Preisfindung von EnvíaYa benutzen. Ansonsten werden Ihren Kunden sowohl die Preise der Sendungszonen und der anderen Erweiterungen, als auch die EnvíaYa-Preise angezeigt.",
    "free_shipping":"Gratisversand",
    "as_defined_price":"Preisanzeige",
    "show_price_as":"Preis als 0.00 anzeigen",
    "do_not_show_price":"Preis nicht anzeigen",
    "contingency_shipping_services":"Kontingenz-Versandprodukte",
    "enable_contingency_shipping_services":"Kontingenz-Versandprodukte aktivieren",
    "contingency_standard_rate":"Standardpauschale",
    "contingency_standard_rate_help":"Dies ist eine Backup / Fallback-Option. Wenn keine Versandgebühren ermittelt werden können (z. B. weil kein verfügbares Versanddienst an die Empfängeradresse zustellt oder technische Probleme auftreten), können Sie Ihrem Kunden einen Standard-Versandservice mit einem Pauschaltarif anzeigen. Wenn Sie in diesem Feld einen beliebigen Wert eingeben, wird diese Kontingenzoptinen Ihren Kunde in diesem Sonderfall angezeigt. Wenn Sie das Feld leer lassen, wird kein Kontingenzprodukt während dem Checkout angezeigt.",
    "contingency_express_rate":"Express-Pauschale",
    "contingency_express_rate_help":"Dies ist eine Backup / Fallback-Option. Wenn keine Versandgebühren ermittelt werden können (z. B. weil kein verfügbares Versanddienst an die Empfängeradresse zustellt oder technische Probleme auftreten), können Sie Ihrem Kunden einen Express-Versandservice mit einem Pauschaltarif anzeigen. Wenn Sie in diesem Feld einen beliebigen Wert eingeben, wird diese Kontingenzoptinen Ihren Kunde in diesem Sonderfall angezeigt. Wenn Sie das Feld leer lassen, wird kein Kontingenzprodukt während dem Checkout angezeigt.",
    "service_name":"Produktname",
    "shipping_services_display":"Versandproduktanzeige",
    "shipping_services_design":"Versandproduktdesign-Typ",
    "shipping_services_design_help":"Diese Option definiert, wie die Versandprodukte im Einkaufswagen und auf der Kassenseite dargestellt werden. Wichtiger Hinweis: Wenn Sie das erweiterte Design aktivieren, müssen wir Änderungen im html-Code der Warenkorb- und Kassenseite vornehmen. Falls Sie visuelle Design-Probleme festestellen sollten, so nutzen sie bitte das Standarddesign.",
    "advanced_shipping_services_design":"Fortgeschrittenes Versandproduktdesign",
    "default_shipping_services_design":"Standard-Versandproduktdesign",
    "carrier_name":"Zustellername",
    "carrier_name_option_1":"Zustellername nicht anzeigen",
    "carrier_name_option_2":"Zustellername anzeigen",
    "carrier_name_help":"Diese Option definiert, ob der Name des Zusteller las Teil des Namens des Versandproduktes auf der Einkaufswagen- und Kassenseite anzeigt wird.",
    "display_carrier_logo":"Zustellerlogo anzeigen",
    "carrier_and_services_configuration_help":"Sie möchten wahrscheinlich nicht mehr als 2 bis 4 Versandoptionen für die Kunden Ihres Shops anbieten. Um die Anzeige einer großen Anzahl von Versandprodukten zu vermeiden und die Antwortzeit bei der Preisfindung zu verbessern, können Sie in Ihrem Rechnungskonto Versandfilter definieren. Typische Filter sind: <ul class=ul-info><li> Nur bestimmte Versanddienst aktivieren </li> <li> Nur bestimmte Versandprodukte aktivieren </li> <li> Nur die günstigsten, schnellsten oder die Versandprodukte mit dem besten Kosten-Nutzen-Verhältnis anzeigen</li> </ul> <div class = url> <a href=https://{#api_link#}/shipping/quoting_filters target=_blank> Sie können Ihre Sendungsfilter hier konfigurieren.</a></div>",
    "custom_design_text":"Bei Bedarf können Sie das Design auch inviduell anpassen, indem Sie die folgenden css-Klassen verwenden:<ul class='ul-info'><li>enviaya_carrier_logo</li><li>enviaya_delivery_date</li><li>enviaya_amount</li><li>enviaya_service</li></ul>Hinweis: Diese css-Klassen werden nur zugewiesen, wenn die Option 'Fortgeschrittenes Versandproduktdesign' aktiviert ist.",
    "advanced_shipping_services_design_warning":"Wichtiger Hinweis: Das fortgeschrittene Design kann zu Konflikten mit Ihrem Theme führen, da wir Stile und Code zu der Warenkorb- und der Kasse-Seite hinzufügen müssen. Bitte wählen Sie das Standardesign aus, falls Sie Probleme auf diesen Seiten haben sollten.",
    "advanced_configuration":"Fortgeschrittene Konfiguration",
    "rate_on_add_to_cart":"Versandkosten beim Hinzufügen zum Warenkorb aktualisieren",
    "rate_on_add_to_cart_info":"<b>Hinweis:</b> Diese Option kann Ihren Shop langsamer machen. Jedes Mal, wenn ein Benutzer einen Artikel zum Warenkorb hinzufügt wird unsere Preisfindungsschnittstelle aufgerufen, was zu einer Zeitverzögerung führen kann. Bitte testen Sie diese Option sorgfältig.",
    "rate_on_add_to_cart_help":"Wenn Sie diese Option aktivieren, werden die verfügbaren Versandprodukte und -kosten bei jedem Hinzufügen eines Artikels zum Warenkorb neu ermittelt.</br > Wir empfehlen, diese Option zu deaktivieren, da sie bei jedem Hinzufügen zum Warenkorb ausgeführt wird. Dementspechend wird die “Zum Warenkorb hinzufügen”-Aktion ein wenig mehr Zeit als normal in Anspruch nehmen (da sie auf den Antwort unserer API warten muss) und kann so die Kundenerfahrung negativ beeinträchtigen.",
    "sender_address":"Senderadresse",
    "add_new_sender":"Absender hinzufügen",
    "download_logs":"Log-Dateien herunterladen",
    "enable_dokan_help":"Wenn Sie diese Option aktivieren, so können Ihre Verkäufer Sendungen mit EnvíaYa in Ihre Shops integrieren und Ihre eigenen API-Schlüssel und Einstellungen unserer Erweiterung nutzen.",
    "enable_dokan":"Dokan-Integration aktivieren",
    "contingency_standard_shipping":"Standardversand aktivieren",
    "contingency_express_shipping":"Expressversand aktivieren",
    "rating_error_no_services_found":"Leider konnten keine Versandprodukte ermittelt werden. Bitte versuchen Sie es erneut oder erstellen Sie Ihre Sendung auf der EnvíaYa-Internetseite.",
    "get_shipment_services":"Versandprodukte ermitteln",
    "service_name_help":"Der dynamische Sendungsproduktname wird automatisch auf Basis der Lieferzeit generiert. Ein Produkt mit einer Lieferung am gleichen Tag wird immer 'Sofortlieferung' genannt, eins mit einer Lieferung morgen 'Nächster Tag', übermorgen als 'Zustellung in 2 Tagen' usw. </br> Der standardistierte Sendungsproduktname verwendet den gleichen Namen unabhängig von der Spedition. D.h. ein Produkt mit Zustellung am nächsten Tag wird immer 'Nächster Tag' genannt, ein langsamere Lieferung 'Standardversand', usw.</br> Der Speditionsproduktname ist der originale Name, der von der Spedition verwendet wird.",
    "shipping_services_design_example":"Beispiel:",
    "create_shipment":"Sendung erstellen",
    "download_label":"Download Etikett",
    "advanced_shipping_services_design_1":"1 Zeile",
    "advanced_shipping_services_design_2":"2 Zeilen",
    "service_name_1":"Dynamischen Dienstnamen verwenden",
    "service_name_2":"Standardisierten Servicenamen verwenden",
    "service_name_3":"Name des Spediteurs verwenden",
    "service_name_4":"Versandproduktname nicht anzeigen",
    "group_by_carrier":"Nach Zusteller gruppieren",
    "status":"Status",
    "php_version":"PHP Version:",
    "wordpress_version":"Wordpress Version:",
    "woocommerce_version":"Woocommerce Version:",
    "curl_existence":"cURL:",
    "support_code":"Support-Code",
    "copy":"Kopieren",
    "domain":"Domäne",
    "api_domain":"enviaya.com.mx",
    "welcome_screen_1_title":"Willkommen! Lassen Sie uns beginnen und unsere Erweiterung konfigurieren.",
    "welcome_screen_1_text":"Als Erstes benötigen wir Ihren API-Schlüssel, um zu starten. Sie können ihn hier in Erfahrung bringen: </br> </br> <a href=https://enviaya.com.mx/shipping/settings#profile target=blank>Zu meinem API-Schlüssel</a> </br> </br> Bitte kopieren Sie Ihren API-Schlüssen und fügen Sie ihn hier ein:",
    "welcome_screen_2_title":"Rechnungskonto",
    "welcome_screen_2_text":"Wir haben festgestellt, dass Ihr Benutzer mehr als ein Rechnungskonto konfiguriert hat. Bitte wählen Sie ein Konto aus:",
    "welcome_screen_3_title":"Senderadresse",
    "welcome_screen_3_text":"Danke! Jetzt wo wir Ihren API-Schlüssel kennen, sind wir bereit eine Senderadresse festzulegen. Sie können Sie hier eingeben: </br> </br> <a href=https://app.enviaya.com.mx/directions/new?origin=true target=blank>Senderadresse eingeben</a> </br> </br> Sobald Sie eine Senderadresse eingegeben haben, können Sie sie hier auswählen:",
    "welcome_screen_4_title":"Optional: Sendungsfilter",
    "welcome_screen_4_text":"Wir empfehlen Ihnen unbedingt Sendungsfilter zu konfigurieren. Dies wird nicht nur die Preisermittlung der Versandprodukte schneller machen, sondern stellt auch sicher, dass Sie Ihren Kunden nicht zu viele Optionen anzeigen. Idealerweise möchten Sie Ihren Kunden sehr wahrscheinlich nur 2-3 Versandprodukte zur Auswahl anbieten. Sie können Ihre Sendungsfilter hier konfigurieren, Sie werden nach dem Speichern völlig automatisch angewandt werden: </br> </br> <a href=https://enviaya.com.mx/shipping/quoting_filters target=blank>Sendungsfilter konfigurieren</a>",
    "welcome_screen_5_title":"Herzlichen Glückwunsch, Sie sind bereit zum Verschicken.",
    "welcome_screen_5_text":"Sie sind jetzt startklar. Bitte prüfen Sie gerne auch die vielen anderen Einstellungsmöglichkeiten, die unser Plugin bietet, oder genießen Sie von nun an einfach Ihren neuen, voll-automatischen Versendungsprozess.",
    "countinue":"Fortfahren",
    "close":"Cerrar",
    "api_key_error":"Der eingegebene API-Schlüssel existiert nicht.",
    "send_shipment_notifications":"Sendungsbenachrichtigungen verschicken",
    "send_shipment_notifications_help":"Wenn diese Option aktiviert ist, verschicken wir Benachrichtungen an Ihre Kunden, nachdem Sie eine Sendung erstellt haben und sobald eine Sendung geliefert wurde. Sie können Ihr eigenes Branding (Logo, Farben, Sender-Email) für diese Benachrichtigungen konfigurieren, indem Sie in Ihrem Mitgliederbereich auf unserer Seite das Menü “Branding” öffnen.",
    "billing_account_help":"Bitte wählen Sie aus, welchem Rechnungskonto Sie die Sendungen Ihres Shops zuordnen möchten. Wenn Sie mehr als ein Rechnungskonto einrichten möchten (z.B. aus internen Abrechnungsgründen), so können Sie <a href=https://enviaya.com.mx/shipping/enviaya_accounts target=blank>{#api_link#}</a> weitere Konten erstellen.",
    "free_shipping_text":"Wenn Sie Ihren Kunden einen kostenlosen Versand anbieten möchten, so können Sie das in Ihrem Mitgliederbereich auf <a href=https://{#api_link#} target=_blank>{#api_link#}</a> konfigurieren. Sie finden die entsprechende Einstellung in <a href=https://{#api_link#}/shipping/enviaya_accounts/{#subsidies_link#}/edit target=_blank>der Konfiguration Ihres Rechnungskontos</a>.",
    "remove_all_settings_and_data":"Alle Einstellungen und Daten beim deinstallieren des Plugins entfernen.",
    "remove_all_settings_and_data_help":"Diese Option entfernt alle Daten der Erweiterung aus der Datenbank, wenn die Erweiterung deinstalliert wird. Bitte nutzen Sie diese Option mit Vorsicht, da sie auch alle Bestellungen, die über die Erweiterung verschickt wurden, beeinträchtigen kann. Ein Teil der Sendungsinformationen dieser Bestellung wird verloren gehen.",
    "enable_api_logs":"API-Logs aktivieren",
    "enable_api_logs_help":"Wenn Sie diese Option aktivieren, speichern wir alle Anfrage und Antworten unserer API. Bitte aktivieren Sie dies nur zum Testen und Debuggen. Wir empfehlen die API-Logs in Live-Umgebungen zu deaktivieren.",
    "download_api_logs":"API-Logs herunterladen",
    "delete_api_logs":"API-Logs löschen",
    "next_day":"Nächster Tag",
    "ex_date":"Montag, Nov. 6",
    "plugin_uri":"Plugin-Seite aufrufen",
    "author_uri":"Von EnvíaYa",
    "zone_name":"Zonenname",
    "zone_name_help":"Dies ist der Name der ausgeschlossenen Zone. Er wird nur intern für Ihre Referenz verwendet.",
    "zone_regions":"Regionen der Zone",
    "zone_regions_help":"Dies sind die Regionen und PLZ der Zone. Wenn die Empfängeradresse mit einem der Einträge übereinstimmt, wird die Preisfindung der Erweitung automatisch übersprungen.",
    "zone_regions_placeholder":"Wählen Sie eine oder mehr Regionen aus.",
    "zone_regions_list_placeholder":"Geben Sie eine PLZ pro Zeile ein.",
    "zone_regions_list_help":"Postleitzahlen können Platzhalter enthalten (z.B. 234*) oder PLZ-Kreise sein (z.B. <code>53000...53999</code>). Ausgeschlossene Zonen funktionieren fast identisch zu den WooCommerce-Versanzonen. Sie können hier die offizielle <a href=\"%s\" target=\"_blank\">Dokumentation</a> lesen.",
    "add_zone":"Zone hinzufügen",
    "excluded_zones":"Ausgeschlossene Zonen",
    "excluded_zones_table_name":"Name",
    "excluded_zones_table_regions":"Regionen",
    "excluded_zones_table_delete":"Löschen",
    "additional_account_configurations_title":"Zusätzliche Kontoeinstellungen",
    "additional_account_configurations_text":"Wir empfehlen Ihnen zusätzliche Einstellungen für Ihr Konto vorzunehmen:<ul class='ul-info'><li>Gratisversand</li><li>Sendungsversicherung</li><li>Abholung im Laden</li><li>Standardabmessungen für Verpackungen</li><li>Paketstücke pro Sendung (Ein Paketstück oder viele)</li></ul><div class=url>Sie können diese Optionen <a href=https://{#api_link#}/shipping/enviaya_accounts/{#subsidies_link#}/edit target=_blank>hier konfigurieren</a>.</div>",
    "additional_account_configurations_store_pickup": "Abholung im Geschäft",
    "additional_options": "Weitere Optionen",
    "woocommerce_disabled_message": "Die EnvíaYa-Erweiterung funktionier nut mit WooCommerce, aber die WooCommerce-Erweiterung ist zurzeit deaktiviert.",
    "technical_error": "Es gab einen technischen Fehler auf unserem Server. Bitte versuchen Sie es später noch einmal.",
    "shipping_delivery_time": "Zustellzeit",
    "shipping_delivery_time_help": "Diese Option legt fest, ob und wie das geschätzte Lieferdatum auf der Warenkorb- und Kassenseite angezeigt werden.",
    "show_estimated_delivery_date": "Geschätztes Lieferdatum anzeigen",
    "show_transit_time": "Lieferzeit anzeigen (Tage)",
    "do_not_show_delivery_time": "Lieferzeit nicht anzeigen",
    "day": "Tag",
    "days": "Tage",
    "hour": "Stunde",
    "hours": "Stunden",
    "shipments": "Sendungen",
    "shipment": "Sendung",
    "purchased_service": "Gekauftes Versandprodukt",
    "service": "Versandprodukt:",
    "estimated_delivery": "Gesch. Lieferung:",
    "tracking_no": "Sendungsverfolgungsnr.",
    "shipment_number": "Sendungsnr.",
    "track_shipment": "Sendung verfolgen",
    "tracking_number_successfuly_updated": "Die Sendungsverfolgunsnummer wurde erfolreich aktualisiert.",
    "the_status_was_updated_successfully": "Der Status wurde erfolreich aktualisiert.",
    "exception": "Fehler: Diese Anfrage wird nicht unterstützt.",
    "the_label_url_was_updated_successfully": "Der Downloadlink des Etiketts wurde erfolreich aktualisiert.",
    "the_shipment_amount_was_updated_successfully": "Der Sendungsbetrag wurde erfolreich aktualisiert.",
    "destination_address_successfuly_updated": "Der Empfängeradresse wurde erfolreich aktualisiert.",
    "the_origin_was_updated_successfully": "Der Senderadresse wurde erfolreich aktualisiert.",
    "an_error_ocurred": "Es ist ein Fehler aufgetreten.",
    "unsuccessful": "Erfolglos",
    "personalize": "",
    "no_access_permissions": "Sie haben keine Berechtigung auf diese Seite zuzugreifen.",
    "update_settings": "Einstellung aktualisieren",
    "get_origin_addresses": "Bitte geben Sie einen korrekten API-Schlüssel ein, um Ihre Senderadressen abzurufen.",
    "no_shipments": "Nein sendung",
    "to_retrieve_your_billing_accounts": "Bitte geben Sie einen korrekten API-Schlüssel ein, um Ihre Rechnungskonten abzurufen.",
    "shipping_service": "Versandprodukt:",
    "enable_currency_support": "Support für Währungen aktivieren",
    "enable_currency_support_help": "Wichtiger Hinweis: Einige Währungsumrechner-Erweiterungen konvertieren die Versandkosten automatisch in die ausgewählte Währung. Wenn Sie eine dieser Erweiterungen benutzen und diese Option aktivieren, kann dies zu einer doppelten Währungsumrechnung und falschen Preisen führen. Wenn Sie eine dieser Erweiterungen nutzen (z.B. Currency Converter) empfehlen wir Ihnen, die Option “Support für Währungen aktiviere” unserer Erweiterung zu deaktiveren.",
    "carrier_and_services_configuration":"Sie können Ihre Versandfilter hier konfigurieren. ",
    "shipping_text":"Versand",
    "subsidies_title":"Versandsubventionen",
    "subsidies_text":"Bei Bedarf können die Sendungspreise von Ihnen subventioniert werden, so dass ab einem bestimmten Bestellwert günsitgere Versandkosten angezeigt werden.",
    "subsidies_link_text":"Sie können hier Subventionen für Ihr Konto konfigurieren.",
    "contingency_services_help":"Wir empfehlen Ihnen diese Option zu aktivieren. Falls auf der Warenkorb und Kassenseite keine Versandprodukte ermittelt werden können (z.B. aufgrund von fehlender Abdeckung oder einem technischen Problem), so kann unsere Erweiterung automatisch ein Standard- und ein Expressversandprodukt mit einem festen Preis anzeigen. Auf diese Art stellen Sie sicher, dass Ihre Kunden Ihren Einkauf immer abschließen können und Sie niemals wegen fehlenden Versandprodukten Verkäufe verlieren.",
    "custom_design_title":"Individuelles Design",
    "default_currency":"Standardwährung",
    "no_dimensions_error":"Mindestens ein Artikel des Warenkorbs hat keine Abmessungen. Bitte fügen Sie entweder die entsprechenden Abmessungen zu jedem Artikel Ihres Shops hinzu oder definieren Sie eine Standardverpackung. Wenn Sie eine Standardverpackung definieren, werden deren Abmessungen genutzt und Sie müssen nicht für jeden einzelnen Artikel Abmessungen eingeben.\n",
    "no_weight_error":"Mindestens einer der Artikel im Warenkorb hat kein Gewicht. Leider hängen die Versandpreise vom Gewicht der Artikel ab und können nicht ohne ein Gewicht ermittelt werden. Bitte stellen Sie sicher, dass Sie für jeden Artikel in Ihrem Shop ein Gewicht eingegeben haben.",
    "configuration":"Konfiguration",
    "plugin_name":"Enviaya-Versand",
    "accounts_missing_api_key":"Bitte geben Sie Ihren API-Schlüssel ein, um Ihre Konten zu laden.",
    "get_api_key":"Zum API-Schlüssel",
    "packagings_missing_api_key":"Bitte geben Sie Ihren API-Schlüssel ein, um Ihre Verpackung (en) zu laden.",
    "select_address":"Bitte geben Sie Ihren API-Schlüssel ein, um Ihre Senderadresse(n) zu laden.",
    "yes_no":"Ja / Nein",
    "select_account":"Wählen Sie Konto",
    "select_sender":"Bitte wählen Sie eine Senderadresse",
    "optional":"Wenn Sie mehr als ein Rechungskonto nutzen, so können Sie definieren, über welches Ihrer Konten Sie die Sendungen Ihres Shops abrechnen möchten.",
    "enable_estimated_shipping":"",
    "enable_estimated_shipping_help":"",
    "price_display":"Price display",
    "express":"Express",
    "system_info":"System-Informationen",
    "save":"Speichern",
    "track":"Sendung verfolgen",
    "delete":"Löschen",
    "see_detailed_tracking":"Detaillierte Sendungsverfolgung öffnen",
    "here":"hier",
    "est_delivery":"Gesch. Lieferung",
    "select_shipping_service":"Wählen Sie einen Versanddienst aus",
    "text_shipping":"Shipping",
    "error_this_request_method_is_not_supported": "Fehler: Diese Anfrage wird nicht unterstützt.",
    "shipping_service_design_type_script":"<script> var value = document.getElementById('carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_shipping_service_design_type').selectedIndex; var f1 = document.getElementById('row_carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_display_carrier_logo'); var f2 = document.getElementById('row_carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_shipping_services_design'); var f3 = document.getElementById('row_carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_shipping_services_design2'); if (value == '0') { f3.style.display = 'none'; } else { f1.style.display = 'none'; f2.style.display = 'none'; } console.log(value); console.log(f1); console.log(f2); console.log(f3);  </script>",
    "rating_error":"Die Preisermittlung der Versandprodukte ist zurzeit nicht vefügbar. Bitte versuchen Sie es später noch einmal.",
    "shipment_booking_error_missing_information":"Die Sendung kann nciht gebucht werden, da Informationen fehlen:",
    "shipment_booking_error":"Die Sendung konnte nicht gebucht werden.",
    "uninstall_warning":"Sind Sie sicher, dass Sie die Erweiterung deinstallieren möchten?",
    "settings_saved_confirmation_message":"Die Konfiguration wurde aktualisiert",
    "order_shipment_title":"Sendungen (EnvíaYa)",
    "vat":"MwSt",
    "total":"Gesamt",
    "amount":"Zwischensumme",
    "no_zip_extenstion":"ZipArchive is missed. Please ask your hosting provider."
}
