{
    "documentation":"Documentation",
    "premium_support":"Premium Support",
    "access_configuration":"Access",
    "technical_configuration":"Technical",
    "api_key_configuration":"API keys",
    "excluded_zones_title":"Excluded zones here",
    "excluded_zones_title_help":"You can define excluded zones to disable the rating of the plugin on the cart and checkout page. This can be useful if you want to define custom shipping options for certain areas. (for example by defining WooCommerce shipping zones for these areas)",
    "billing_account":"Billing account",
    "brand_name":"EnvíaYa",
    "title":"Title",
    "enabled":"Enabled",
    "api_key":"API Key",
    "api_key_help":"You can either find your API Key in your user profile or click on the link to obtain your API",
    "test_api_key":"Test API Key",
    "use_enviaya":"Use enviaya",
    "use_enviaya_help":"You can either find your API Key in your user profile or click on the link to obtain your API",
    "ship_to_countries":"Ship to Applicable Countries",
    "all_countries":"All Countries",
    "specific_countries":"Specific Countries",
    "timeout":"Service Timeout",
    "timeout_help":"This value defines the maximum time you want to wait to get a response from our API. After this time, an error is thrown, or the contingency shipping services are shown during the user checkout. Our suggestion is to put 30 seconds.",
    "enable_test_mode":"Enable Test Mode",
    "test_mode_help":"No valid shipments will be created or charged in test mode.",
    "no":"No",
    "yes":"Yes",
    "account":"Billing Account",
    "rating_configuration":"Rating",
    "enable_rating":"Enable Rating",
    "rates_title":"This is the title shown to the store customers on top of the list of the shipping services during checkout. You can leave it blank if you don't want to show any title.",
    "remove_rating_zones_hint":"We recommend to remove all shipping zones and to disable any other shipping rating plugin you might be using if you enable rating. Otherwise your customers will see the shipping zones and other plugins rates as well as the ones offered by our system.",
    "free_shipping":"Free Shipping",
    "as_defined_price":"Price display",
    "show_price_as":"Show price as 0.00",
    "do_not_show_price":"Do not show price",
    "contingency_shipping_services":"Contingency Shipping Services",
    "enable_contingency_shipping_services":"Enable Contingency Shipping Services",
    "contingency_standard_rate":"Standard Flat Rate",
    "contingency_standard_rate_help":"This a backup/ fall back option. If no shipment rates can be obtained (e.g. because there is no coverage on the Recipient or because of technical problems) you can display Standard Shipping Service with a fixed rate to your customer. If you put any value into this field, your customers will see this shipping service and rate during checkout. If you leave it empty, no contingency shipping service will be displayed.",
    "contingency_express_rate":"Express Flat Rate",
    "contingency_express_rate_help":"This a backup/ fall back option. If no shipment rates can be obtained (e.g. because there is no coverage on the Recipient or because of technical problems) you can display Express Shipping Service with a fixed rate to your customer. If you put any value into this field, your customers will see this shipping service and rate during checkout. If you leave it empty, no contingency shipping service will be displayed.",
    "service_name":"Service name",
    "shipping_services_display":"Shipping Services Display",
    "shipping_services_design":"Shipping Service Design Type",
    "shipping_services_design_help":"This option defines how the shipping services are displayed on the cart and checkout pages. Please note: If you enable the advanced design, which includes the carrier logo and some other tweaks, we need to hook into your theme. In case you notice any visual design problems, please use the default design.",
    "advanced_shipping_services_design":"Advanced shipping services design",
    "default_shipping_services_design":"Default shipping services design",
    "carrier_name":"Carrier Name",
    "carrier_name_option_1":"Don't show carrier name",
    "carrier_name_option_2":"Show carrier name",
    "carrier_name_help":"This option defines whether the carrier name is included in the shipping service names displayed on the cart and checkout page.",
    "display_carrier_logo":"Display Carrier Logo",
    "carrier_and_services_configuration_help":"You most likely do not want to show more than 2-4 shipment options to your store's customers. In order to avoid displaying a big number of shipment services and improve rating response times, you can define shipment filters for your billing account. Typical filters are:<ul class='ul-info'><li>Enable only certain carriers</li><li>Enable only certain services</li><li>Only show the cheapest, quickest or best cost-benefit relation service</li></ul><div class=url><a href=https://{#api_link#}/shipping/quoting_filters target=_blank>You can configure your shipment filters here.</a></div>",
    "custom_design_text":"If you like to, you can customize the design with your own styles using the following classes:<ul class='ul-info'><li>enviaya_carrier_logo</li><li>enviaya_delivery_date</li><li>enviaya_amount</li><li>enviaya_service</li></ul>Please note: These css classes are only applied work if the option 'Advanced shipping services design' is enabled.",
    "advanced_shipping_services_design_warning":"Important hint: The advanced shipping service design can cause conflicts with your theme, as we habe to add some styles and custom code into the WooCommerce cart and checkout pages. Please switch to the default design if you are having any problems on these pages.",
    "advanced_configuration":"Advanced Configuration",
    "rate_on_add_to_cart":"Update shipping cost on add to cart",
    "rate_on_add_to_cart_info":"<b>Hint:</b> This option might slow your store down. Everytime a user adds an article to the shipping cart, our rating API will be called which can cause a delay. Please test this option carefully.",
    "rate_on_add_to_cart_help":"If you enable this option, the plugin will calculate and update the shipment services each time your customer adds an item to the shopping cart.</br> We recommend to disable this option, as it is executed each time a customer adds an item to the shopping cart. The add to cart action will take slightly longer than normally (as it has to wait for the response of our shipping API) and can impact the customer experience.",
    "sender_address":"Sender Address",
    "add_new_sender":"Add sender address",
    "download_logs":"Download logs",
    "enable_dokan_help":"If you enable this option, your vendors can integrate EnvíaYa shipping into their stores, using their own API credentials and plugin configuration.",
    "enable_dokan":"Enable Dokan integration",
    "contingency_standard_shipping":"Enable standard shipping (Contingency only)",
    "contingency_express_shipping":"Enable express shipping (Contingency only)",
    "rating_error_no_services_found":"Unfortunately, no shipment services could be obtained. Please try again or create your shipment on on the EnvíaYa website.",
    "get_shipment_services":"Get shipment services",
    "service_name_help":"The dynamic service name is dynamically created based on the transit time. A service which arrives today will be called \"Same Day Delivery\", a service which arrives tomorrow \"1 Day Delivery\" and so on.</br>The standardized service name uses the same service name across all carrier services. For example, a next day service will always be called next day, an economic service always be called economic, independent on the carrier.</br>The carrier service name is the senderal service name used by the carrier.",
    "shipping_services_design_example":"Example:",
    "create_shipment":"Create shipment",
    "download_label":"Download Label",
    "advanced_shipping_services_design_1":"1 line",
    "advanced_shipping_services_design_2":"2 lines",
    "service_name_1":"Use dynamic service name",
    "service_name_2":"Use standardized service name",
    "service_name_3":"Use carrier service name",
    "service_name_4":"Do not show service name",
    "group_by_carrier":"Group by carrier",
    "status":"Status",
    "php_version":"PHP version:",
    "wordpress_version":"Wordpress version:",
    "woocommerce_version":"Woocommerce Version:",
    "curl_existence":"cURL:",
    "support_code":"Support Code",
    "copy":"Copy",
    "domain":"Domain",
    "api_domain":"enviaya.com.mx",
    "welcome_screen_1_title":"Hey there! Let’s get started and configure your new shipping plugin.",
    "welcome_screen_1_text":"First of all, we will need your API key to get started. You can get it here: </br> </br> <a href=https://enviaya.com.mx/shipping/settings#profile target=_blank>Get my API key</a> </br> </br> Please copy your API key and paste it here:",
    "welcome_screen_2_title":"Billing account",
    "welcome_screen_2_text":"We noticed that you have more than one billing account configured for your user. Please select one here:",
    "welcome_screen_3_title":"Sender address",
    "welcome_screen_3_text":"Thanks! Now that we know your API key, we will need you to enter a sender address. You can do so here: </br> </br> <a href=https://app.enviaya.com.mx/directions/new?origin=true target=_blank> Enter my sender address </a> </br> </br> Once you have entered a sender address, you can choose it from this list:",
    "welcome_screen_4_title":"Optional: Shipment filters",
    "welcome_screen_4_text":"We strongly recommend you to define shipment filters. This will not only make the shipment rating faster, but will also make sure that you do not overwhelm your customers with too many shipment services. Ideally you probably just want to show them 2-3 options. </br> </br> Shipment filters allow you to select only certain carriers and also to define advanced filter such as only showing the fastest and the cheapest service, for example. You can configure your shipment filters here, they will be applied automatically once you saved them. </br> </br> <a href=https://enviaya.com.mx/shipping/quoting_filters target=_blank>Configure shipment filters</a>",
    "welcome_screen_5_title":"Congratulations, you are ready to ship.",
    "welcome_screen_5_text":"You are all set. Please feel free to check any of the other configurations you can do in our plugin, or just enjoy your new, fully automated shipping process.",
    "countinue":"Continue",
    "close":"Close",
    "api_key_error":"The API key provided does not exist.",
    "send_shipment_notifications":"Send shipment notifications",
    "send_shipment_notifications_help":"Please select which account you want to your stores shipments to be billed to. If you want to manage more than one billing account (for example for internal reporting reasons), you can create additional billing accounts <a href='https://enviaya.com.mx/shipping/enviaya_accounts'>{#api_link#}</a>.",
    "billing_account_help":"Please select which account you want to your stores shipments to be billed to. If you want to manage more than one billing account (for example for internal reporting reasons), you can create additional billing accounts <a href='https://enviaya.com.mx/shipping/enviaya_accounts'>{#api_link#}</a>.",
    "free_shipping_text":"If you want to offer your customers free shipping, you can configure it in your user's area on <a href=https://{#api_link#} target=_blank>{#api_link#}</a>. You will find the setting in your <a href=https://{#api_link#}/shipping/enviaya_accounts/{#subsidies_link#}/edit target=_blank>billing account's configuration</a>.",
    "remove_all_settings_and_data":"Remove all settings and data when uninstalling the plugin.",
    "remove_all_settings_and_data_help":"This option will remove all the plugins data from your database on uninstall. Please use this option with care, as it will affect all orders which have been shipped using the plugins functionality. Some of the orders shipping data will be lost.",
    "enable_api_logs":"Enable API logs",
    "enable_api_logs_help":"If you enable this option, we will save all requests and responses to our API. Please only enable this for testing and debugging. We recommend to disable it in live environments.",
    "download_api_logs":"Download API logs",
    "delete_api_logs":"Delete API logs",
    "next_day":"Next day",
    "ex_date":"Monday, Nov. 6",
    "plugin_uri":"Visit plugin site",
    "author_uri":"By EnvíaYa",
    "zone_name":"Zone name",
    "zone_name_help":"This is the name of the excluded zone. It is only used internally for your reference.",
    "zone_regions":"Zone regions",
    "zone_regions_help":"These are the regions inside this zone. If a delivery address of an order is inside those regions, the rating of the plugin will be skipped automatically.",
    "zone_regions_placeholder":"Select regions within this zone",
    "zone_regions_list_placeholder":"Enter 1 postal code per line",
    "zone_regions_list_help":"Postcodes containing wildcards (e.g. CB23*) or fully numeric ranges (e.g. <code>90210...99000</code>) are also supported. The excluded zones work in a very similar way as the WooCommerce own shipping zones. You can read the official WooCommerce <a href=\"%s\" target=\"_blank\">documentation</a>) for more information.",
    "add_zone":"Add Zone",
    "excluded_zones":"Excluded Zones",
    "excluded_zones_table_name":"Name",
    "excluded_zones_table_regions":"Regions",
    "excluded_zones_table_delete":"Delete",
    "additional_account_configurations_title":"Additional account configurations",
    "additional_account_configurations_text":"We recommend to configure additional settings for your account:<ul class='ul-info'><li>Free shipping</li><li>Shipment insurance</li><li>Store pickup</li><li>Standard packaging dimensions</li><li>Shipment parcel quantities (One vs many)</li><li>and more</li></ul><div class=url>You can configure these options <a href=https://{#api_link#}/shipping/enviaya_accounts/{#subsidies_link#}/edit target=_blank>here</a>.</div>",
    "additional_account_configurations_store_pickup": "Store Pickup",
    "additional_options": "Additional options",
    "woocommerce_disabled_message": "The EnvíaYa plugin only works with WooCommerce, but the WooCommerce plugin is disabled at the moment.",
    "technical_error": "There was a technical error on our server. Please try again later.",
    "shipping_delivery_time": "Delivery time",
    "shipping_delivery_time_help": "This defines if and how the estimated delivery date will be shown on the cart and checkout page.",
    "show_estimated_delivery_date": "Show estimated delivery date",
    "show_transit_time": "Show transit time (days)",
    "do_not_show_delivery_time": "Do not show delivery time",
    "day": "day",
    "days": "days",
    "hour": "hour",
    "hours": "hours",
    "shipments": "Shipments",
    "shipment": "Shipment",
    "purchased_service": "Purchased service:",
    "service": "Service:",
    "estimated_delivery": "Est. Delivery:",
    "tracking_no": "Tracking no.",
    "shipment_number": "Shipment no.",
    "track_shipment": "Track",
    "tracking_number_successfuly_updated": "The tracking number was updated successfully.",
    "the_status_was_updated_successfully": "The status was updated successfully.",
    "exception": "Exception: ",
    "the_label_url_was_updated_successfully": "The label URL was updated successfully.",
    "the_shipment_amount_was_updated_successfully": "The shipment amount was updated successfully.",
    "destination_address_successfuly_updated": "The destination was updated successfully.",
    "the_origin_was_updated_successfully": "The origin was updated successfully.",
    "an_error_ocurred": "An error ocurred.",
    "unsuccessful": "Unsuccessful",
    "personalize": "Personalize your store page by telling customers a little enviaya yourself.",
    "no_access_permissions": "You are not allowed to view this page.",
    "update_settings": "Update settings",
    "get_origin_addresses": "Please enter a valid API key to retrieve your origin addresses.",
    "no_shipments": "No shipments",
    "to_retrieve_your_billing_accounts": "Please enter a valid API key to retrieve your billing accounts.",
    "shipping_service": "Shipping service:",
    "enable_currency_support": "Enable currency support",
    "enable_currency_support_help": "Important hint: Some currency converter plugins convert the shipping costs to the selected currency automatically. If you use any of these plugins, turning on this option can lead to double conversions and wrong prices. If you have any of these plugins installed (e.g. the Currency Converter plugin), we recommend to disable the “Enable currency support” option of our plugin.",
    "carrier_and_services_configuration":"You can select your carriers and services here.",
    "shipping_text":"Shipping",
    "subsidies_title":"Shipment subsidies",
    "subsidies_text":"Shipment service prices can be subsidiezed by you if needed. This way, more economic shipping prices will be available to your customers, depending on their minimum order amount.",
    "subsidies_link_text":"You can configure subsidies for your account here.",
    "contingency_services_help":"We strongly recommend to enable this option. If no shipment rates can be obtained on the shopping cart and checkout page (e.g. because there is no coverage on the Recipient or because of technical problems), our plugin can show a standard and an express backup service with a fixed cost. By enabling this option you can make sure that your customers can always select a shipping service and finish their purchase. This way you will never lose sales due to missing shipping rates.",
    "custom_design_title":"Custom Design",
    "default_currency":"Default currency",
    "no_dimensions_error":"At least one of the articles in the cart does not have any dimensions. Please either add dimensions to each article in your shop or define a standard packaging. If you define a standard packaging for your account, we will use its dimensions and you do not need to define dimensions for each article of your store.",
    "no_weight_error":"At least one of the articles in the shopping cart do not have any weight configured. Unfortunately, shipping rates depend on the article weights and we cannot determine any rates without it. Please make sure you have entered a weight for each article in your store.",
    "configuration":"Configuration",
    "plugin_name":"Enviaya Shipping",
    "accounts_missing_api_key":"Please enter your API key to load your account(s).",
    "get_api_key":"Get your API Key",
    "packagings_missing_api_key":"Please enter your API key to load your packaging(s).",
    "select_address":"Please enter your API key to load your sender address(s).",
    "yes_no":"Yes / No",
    "select_account":"Please select an Account",
    "select_sender":"Please select an sender address",
    "optional":"If you manage more than one billing account, you can specify which account you want to bill the store's shipments to.",
    "enable_estimated_shipping":"Enable Estimated Shipping in Cart?",
    "enable_estimated_shipping_help":"If you enable this option, your customers can see the shipping services, cost and est. delivery dates even before checkout when the open their shopping cart. (If it is disabled, we will only show this information on the checkout page)",
    "price_display":"Price display",
    "express":"Express",
    "system_info":"System Info",
    "save":"Save",
    "track":"Track",
    "delete":"Delete",
    "see_detailed_tracking":"See detailed tracking",
    "here":"here",
    "est_delivery":"Est. delivery",
    "select_shipping_service":"Select a shipping service:",
    "text_shipping":"Shipping",
    "error_this_request_method_is_not_supported": "Error: This request method is not supported.",
    "shipping_service_design_type_script":"<script> var value = document.getElementById('carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_shipping_service_design_type').selectedIndex; var f1 = document.getElementById('row_carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_display_carrier_logo'); var f2 = document.getElementById('row_carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_shipping_services_design'); var f3 = document.getElementById('row_carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_shipping_services_design2'); if (value == '0') { f3.style.display = 'none'; } else { f1.style.display = 'none'; f2.style.display = 'none'; } console.log(value); console.log(f1); console.log(f2); console.log(f3); </script>",
    "rating_error":"Shipment rating is not available at the moment. Please try again later.",
    "shipment_booking_error_missing_information":"The shipment cannot be booked as some information is missing.",
    "shipment_booking_error":"The shipment could not be booked.",
    "uninstall_warning":"Are you sure you want to uninstall the plugin?",
    "settings_saved_confirmation_message":"The settings were updated.",
    "order_shipment_title":"Shipments (EnvíaYa)",
    "vat":"VAT",
    "total":"Total",
    "amount":"Subtotal",
    "no_zip_extenstion":"ZipArchive is missed. Please ask your hosting provider."
}
