{
    "documentation":"Documentación",
    "premium_support":"Soporte Premium",
    "access_configuration":"Acceso",
    "technical_configuration":"Técnica",
    "api_key_configuration":"Claves API",
    "excluded_zones_title":"Zonas excluidas",
    "excluded_zones_title_help":"Puedes definir zonas excluidas para deshabilitar la cotización de la extension en las páginas del carrito y de la caja. Esto puede ser útil en caso que deseas definir opciones de envío customizados para áreas especificas. (p.e. definiendo zonas de envío de WooCommerce para estos áreas)",
    "billing_account":"Cuenta de facturación",
    "brand_name":"EnvíaYa",
    "title":"Título",
    "enabled":"Habilitado",
    "api_key":"Clave API",
    "api_key_help":"Puedes obtener tu clave API en el panel de administración de o dando clic en el link",
    "test_api_key":"Clave API de prueba",
    "use_enviaya":"",
    "use_enviaya_help":"",
    "ship_to_countries":"Países aplicables para envío",
    "all_countries":"Todos los países",
    "specific_countries":"Países específicos",
    "timeout":"Max. Tiempo de respuesta servidor (Timeout)",
    "timeout_help":"Ayuda: Se refiere al tiempo de espera para obtener una respuesta por parte del sistema. Nuestra sugerencia es que ingreses 30",
    "enable_test_mode":"Habilitar modo de prueba",
    "test_mode_help":"No se generan ni cobran envíos válidos en el modo de prueba.",
    "no":"No",
    "yes":"Sí",
    "account":"Cuenta de facturación",
    "rating_configuration":"Cotizador",
    "enable_rating":"Habilitar cotizador",
    "rates_title":"Este título se muestra sobre las opciones de cotización que verá el cliente en tu tienda. Si lo prefieres, puedes dejar este campo en blanco.",
    "remove_rating_zones_hint":"Te recomendamos eliminar todas las Zonas de Envío (Shipping Zones) y deshabiltar cualquier otro cotizador de envíos que tengas instalado en la tienda para que la extensión de cotizaciones funcione correctamente, pues de lo contrario, tus clientes verán las opciones de envío que ofrece nuestro cotizador, además de las que tengas configuradas en tu tienda.",
    "free_shipping":"Envíos gratuitos",
    "as_defined_price":"Visualización de precio",
    "show_price_as":"Mostrar precio como 0.00",
    "do_not_show_price":"No mostrar precio",
    "contingency_shipping_services":"Servicios de contingencia",
    "enable_contingency_shipping_services":"Habilitar envíos de contingencia",
    "contingency_standard_rate":"Tarifa Plana para servicio Estándar",
    "contingency_standard_rate_help":"Esta es una opción de respaldo. Si al cotizar en la tienda, el sistema no arroja resultados (ya sea porque no existe cobertura en el destino o por cualquier problema técnico) puedes mostrar este servicio estándar una tarifa plana para a tus clientes. Si pones cualquier valor en este campo, tus clientes verán este servicio y  costo de envío al cotizar. Si lo dejas vacío, no se ofrecerán servicios de envío de contingencia cuando el cotizador no esté disponible.",
    "contingency_express_rate":"Tarifa Plana para servicio Exprés",
    "contingency_express_rate_help":"Esta es una opción de respaldo. Si al cotizar en la tienda, el sistema no arroja resultados (ya sea porque no existe cobertura en el destino o por cualquier problema técnico) puedes mostrar este servicio estándar una tarifa plana para a tus clientes. Si pones cualquier valor en este campo, tus clientes verán este servicio y  costo de envío al cotizar. Si lo dejas vacío, no se ofrecerán servicios de envío de contingencia cuando el cotizador no esté disponible.",
    "service_name":"Nombre de servicio",
    "shipping_services_display":"Visualización de servicios de envío",
    "shipping_services_design":"Elige el diseño de las opciones de envío",
    "shipping_services_design_help":"Esta opción define como se mostrarán los nombres de las opciones de envío en el carrito y en el checkout. Atención: si activas la opción de diseño avanzado que incluye el logo de la mensajería y otros ajustes, tenemos que ajustar tu plantilla de diseño. En caso de que haya algún problema de visualización, te recomendamos utilizar la opción de diseño estandar.",
    "advanced_shipping_services_design":"Diseño avanzado de servicios de envío",
    "default_shipping_services_design":"Diseño predeterminado de servicios de envío",
    "carrier_name":"Nombre de la paquetería",
    "carrier_name_option_1":"No mostrar nombre de la paquetería",
    "carrier_name_option_2":"Mostrar nombre de la paquetería",
    "carrier_name_help":"Esta opción define si se muestra el nombre de las paqueterías como parte del nombre del servicio de envío en las páginas del carrito y de la caja.",
    "display_carrier_logo":"Mostrar el logotipo de la mensajería",
    "carrier_and_services_configuration_help":"Es probable que no quieras mostrar más de 2-4 opciones de envío en tu tienda. Para evitar desplegar muchas opciones en tu tienda y mejorar el tiempo de respuesta de la cotización, puedes definir filtros en tu cuenta de facturación. Los filtros más sugeridos son<ul class='ul-info'><li>Elegir solo ciertas paqueterías</li><li>Elegir solo ciertos servicios</li><li>Solo mostrar los envíos más económicos, el más rápido o el mejor en relación de costo- beneficio</li></ul><div class='url'><a href=https://{#api_link#}/shipping/quoting_filters target=blank>Puedes configurar los filtros aquí</a></div>",
    "custom_design_text":"Si gustas, puedes cutomizar el diseño usando estas clases de css:<ul class='ul-info'><li>enviaya_carrier_logo</li><li>enviaya_delivery_date</li><li>enviaya_amount</li><li>enviaya_service</li></ul>Aviso: Estas clases css solamente se asignan si la opción 'Diseño avanzado de servicios de envío' está habilitada.",
    "advanced_shipping_services_design_warning":"Aviso importante: El diseño avanzado de los servicios de envío puede causar conflictos con tu tema, porque tenemos que agregar unos estilos y códigos a las páginas del carrito y de la caja. Por favor cambia al diseño estándard si tienes algun problema en estas páginas.",
    "advanced_configuration":"Configuración avanzada",
    "rate_on_add_to_cart":"Actualizar costos del envío al agregar al carrito",
    "rate_on_add_to_cart_info":"<b>Sugerencia:</b> Esta opción tal vez realentiza tu tienda. Cada que un usuario agregue un artículo al carrito, se llamará a nuestra API lo que puede causar un retraso. Por favor prueba esta opción con cuidado.",
    "rate_on_add_to_cart_help":"Si habilitas esta opción, la extensión va a calcular y actualizar los servicios de envío cada vez cuando tu cliente agregar un producto a su carrito.</br> Recomendamos desactivar esta opción, porque se ejecuta cada vez cuando se agrega un producto al carrito. La acción “Agregar al carrito” ya a tardar un poco más de lo normal (porque tiene que esperar la respuesta de nuestra API) y puede impactar de una manera negativa la experiencia del cliente.",
    "sender_address":"Dirección de origen",
    "add_new_sender":"Añadir dirección de origen",
    "download_logs":"Descargar logs",
    "enable_dokan_help":"Si habilitas esta opción, los vendedores de tu marketplace podrán integrar los servicios de envío de EnvíaYa! en sus tiendas, usando sus propias credenciales de la API y su propia configuración de la extensión.",
    "enable_dokan":"Habilitar integración Dokan",
    "contingency_standard_shipping":"Habilitar envío estándar (solo contingencia)",
    "contingency_express_shipping":"Habilitar envío Exprés (solo contingencia)",
    "rating_error_no_services_found":"Lamentablemente no se pudo obtener ningún servicio de envío. Por favor intenta nuevamente o generar tu envío en la página web de EnvíaYa.",
    "get_shipment_services":"Obtener servicios de envío",
    "service_name_help":"El nombre del dinámico del servicio se crea en función del tiempo de tránsito. Un servicio que llega hoy se llamará \"Entrega en el mismo día\", un servicio que llega mañana \"Entrega de 1 día\" y así sucesivamente.</br> El nombre de servicio estandarizado utiliza el mismo nombre de servicio en todos los servicios de operador. Por ejemplo, un servicio al día siguiente siempre se llamará al día siguiente, un servicio económico siempre se llamará económico, independiente del operador.",
    "shipping_services_design_example":"Ejemplo:",
    "create_shipment":"Crear envío",
    "download_label":"Descargar etiqueta",
    "advanced_shipping_services_design_1":"1 línea",
    "advanced_shipping_services_design_2":"2 líneas",
    "service_name_1":"Usar nombre de servicio dinámico",
    "service_name_2":"Usar nombre de servicio estandarizado",
    "service_name_3":"Usar el nombre del servicio del operador",
    "service_name_4":"No mostrar nombre del servicio",
    "group_by_carrier":"Agrupar por transportista",
    "status":"Estatus",
    "php_version":"Versión PHP:",
    "wordpress_version":"Versión Wordpress:",
    "woocommerce_version":"Versión Woocommerce:",
    "curl_existence":"cURL:",
    "support_code":"Código de soporte",
    "copy":"Copiar",
    "domain":"Dominio",
    "api_domain":"enviaya.com.mx",
    "welcome_screen_1_title":"¡Bienvenido! Gracias por elegir EnvíaYa como opción para tus envíos. Empecemos y configuramos tu nueva extensión de envíos.",
    "welcome_screen_1_text":"Para comenzar, copia y pega tus API Keys. Las puedes conseguir aquí:</br> </br> <a href=https://enviaya.com.mx/shipping/settings#profile target=blank>Obtener mi API Key</a>",
    "welcome_screen_2_title":"Cuenta de facturación",
    "welcome_screen_2_text":"Notamos que tienes más de una cuenta de facturación configurada con este usuario. Por favor selecciona una aquí:",
    "welcome_screen_3_title":"Dirección de origen",
    "welcome_screen_3_text":"¡Gracias! Ahora que tenemos tu API Key, necesitas ingresar una dirección de origen. Puedes hacerlo aquí:</br> </br> <a href=https://app.enviaya.com.mx/directions/new?origin=true target=blank>Ingresar dirección de origen</a></br> </br> Una vez que hayas ingresado la dirección, podrás elegirla en la lista:",
    "welcome_screen_4_title":"Opcional: Filtros de envío",
    "welcome_screen_4_text":"Te recomendamos ampliamente que configures filtros de paqueterías y servicios. Esto no solo hará que las cotizaciones sean más rápidas, sino que ayudará a que tus clientes no vean demasiadas opciones de envío. Lo ideal es mostrar de 2 a 3 opciones. Los filtros de paqueterías y servicios te permiten seleccionar ciertas paqueterías y servicios de cada una, así como definir filtros avanzados para mostrar, por ejemplo, sólo la opción más rápida o el servicio más económico. Puedes configurar estos filtros aquí, y se aplicarán automáticamente una vez que guardes los cambios.</br> </br> <a href=https://enviaya.com.mx/shipping/quoting_filters target=blank>Configurar filtros de paqueterías y servicios</a>",
    "welcome_screen_5_title":"Felicitaciones, estás listo para enviar.",
    "welcome_screen_5_text":"Ya estás listo para disfrutar de un proceso de envío completamente automatizado. Si deseas hacer cambios en cualquier otra configuración, puedes hacerlo directamente desde nuestro plugin.",
    "countinue":"Continuar",
    "close":"Cerrar",
    "api_key_error":"La clave API proporcionado no existe.",
    "send_shipment_notifications":"Enviar notificaciones de envío",
    "send_shipment_notifications_help":"Si esta opción está activa, enviaremos una notificación después de que el envío haya sido creado, notificando al destinatario detalles de la entrega. Puedes personalizar este correo si así lo deseas (por ejemplo logo, colores, dirección de remitente). Para hacerlo, por favor localiza el menú 'Branding' dentro de tu cuenta en nuestra plataforma.",
    "billing_account_help":"Por favor selecciona la cuenta que deseas usar para la facturación de los envíos. Si deseas usar más de una cuenta de facturación (para gestión de reportes internos, por ejemplo), puedes crear cuentas de facturación adicionales <a href=https://enviaya.com.mx/shipping/enviaya_accounts target=blank>{#api_link#}</a>.",
    "free_shipping_text":"Si quieres ofrecer envíos gratuitos a tus clientes, lo puedes hacer en el área de tu usuario en <a href=https://{#api_link#} target=_blank>{#api_link#}</a>. Encuentras la opción en la <a href=https://{#api_link#}/shipping/enviaya_accounts/{#subsidies_link#}/edit target=_blank>configuración de tu cuenta.</a>.",
    "remove_all_settings_and_data":"Eliminar la configuración y los datos completos cuando se desinstala la extensión",
    "remove_all_settings_and_data_help":"Esta opción eliminará completamente la información del plugin en su base datos. Por favor considere que la información de los pedidos que se hayan enviado usando en plugin se verán afectados por esta acción. IMPORTANTE: Este proceso puede ocasionar la pérdida de algunos datos de las ordenes de envío.",
    "enable_api_logs":"Habilitar Logs de API",
    "enable_api_logs_help":"Si habilitas esta opción, guardamos de todas las solicitudes y respuestas de nuestra API. Por favor solamente habilitala para pruebas y debugging. Recomendamos no habilitarla en ambientes productivos.",
    "download_api_logs":"Descargar logs de la API",
    "delete_api_logs":"Eliminar logs de API",
    "next_day":"Día siguiente",
    "ex_date":"Lunes, Nov. 6",
    "plugin_uri":"Visitar la web del plugin",
    "author_uri":"Por EnvíaYa",
    "zone_name":"Nombre de zona",
    "zone_name_help":"Esto es el nombre de la zona. Solamente se usa internamente para tu referencia.",
    "zone_regions":"Regiones de la zona",
    "zone_regions_help":"Estos son las regiones y códigos postales de la zona. Si la dirección de entrega de un pedido está en una de estas zonas, se omita la cotización con la extensión.",
    "zone_regions_placeholder":"Selecciona regiones de la zona",
    "zone_regions_list_placeholder":"Ingresa un código postal por línea",
    "zone_regions_list_help":"Puedes poner códigos postales que contienen comodínes (p.e. 231*) o que son rangos (p.e. <code>11500...11900</code>). Las zonas excluidas funcionan de una manera muy parecidas a las zonas de envío de WooCommerce mismo. Puedes leer la documentación oficial <a href=\"%s\" target=\"_blank\">aquí</a>) para más información.",
    "add_zone":"Agregar zona",
    "excluded_zones":"Zonas excluidas",
    "excluded_zones_table_name":"Nombre",
    "excluded_zones_table_regions":"Regiones",
    "excluded_zones_table_delete":"Eliminar",
    "additional_account_configurations_title":"Configuraciones adicionales de la cuenta",
    "additional_account_configurations_text":"Recomendamos configurar ajustes adicionales para tu cuenta:<ul class='ul-info'><li>Envíos gratuitos</li><li>Seguro de envíos</li><li>Recolección en tienda</li><li>Dimensiones estandares de empaques</li><li>Cantidad de paquetes por envío (Uno o muchos)</li></ul><div class=url>Puedes configurar estas opciones <a href=https://{#api_link#}/shipping/enviaya_accounts/{#subsidies_link#}/edit target=_blank>aquí</a>.</div>",
    "additional_account_configurations_store_pickup": "Recolección en tienda",
    "additional_options": "Opciones adicionales",
    "woocommerce_disabled_message": "La extensión de EnvíaYa solamente funciona con WooCommerce, pero la extensión de WooCommerce está deshabilitada.",
    "technical_error":"Hubo un error técnico en nuestro servidor. Por favor intentalo de nuevo más tarde.",
    "shipping_delivery_time": "Tiempo de entrega",
    "shipping_delivery_time_help": "Esta opción establece de qué forma se muestra el tiempo estimado de entrega en las páginas del carrito y de la caja.",
    "show_estimated_delivery_date": "Mostrar fecha de entrega estimada",
    "show_transit_time": "Mostrar tiempo de tránsito (días)",
    "do_not_show_delivery_time": "No mostrar tiempo de entrega",
    "day": "día",
    "days": "días",
    "hour": "hora",
    "hours": "horas",
    "shipments": "Envíos",
    "shipment": "Envío",
    "purchased_service": "Servicio comprado:",
    "service": "Servicio:",
    "estimated_delivery": "Entega est.:",
    "tracking_no": "No. de Rastreo",
    "shipment_number": "No del envío",
    "track_shipment": "Rastrear",
    "tracking_number_successfuly_updated": "Se actualizó exitosamente el número de rastreo.",
    "the_status_was_updated_successfully": "Se actualizó exitosamente el estatus.",
    "exception": "Excepción: ",
    "the_label_url_was_updated_successfully": "Se actualizó exitosamente el enlace de la etiqueta.",
    "the_shipment_amount_was_updated_successfully": "Se actualizó exitosamente el monto del envío.",
    "destination_address_successfuly_updated": "Se actualizó exitosamente la dirección del destino.",
    "the_origin_was_updated_successfully": "Se actualizó exitosamente la dirección del origen.",
    "an_error_ocurred": "Se ocurrió un error.",
    "unsuccessful": "Sin exíto",
    "personalize": "",
    "no_access_permissions": "No tienes permiso de ver esta página.",
    "update_settings": "Actualizar configuración",
    "get_origin_addresses": "Por favor ingresa una clave API válido para recibir tus direcciones de origen.",
    "no_shipments": "No envío",
    "to_retrieve_your_billing_accounts": "Por, favor ingresa una clave API válido para recibir tus cuentas de facturación.",
    "shipping_service": "Servicio de envío:",
    "enable_currency_support": "Habilitar soporte de monedas",
    "enable_currency_support_help": " ",
    "carrier_and_services_configuration":"Sie können Ihre Zusteller und Versandprodukte hier einstellen.",
    "shipping_text":"Envíos",
    "subsidies_title":"Subsidios de envío",
    "subsidies_text":"Puedes subsidiar los costos de envío si gustas. De esta manera, tus clientes pueden aceder a precios de envío más económicos, dependiendo del monto de su pedido.",
    "subsidies_link_text":"Puedes configurar subsidios para tu cuenta aquí.",
    "contingency_services_help":"Te recomendamos habilitar esta opción. Si no es posible obtener tarifas de envío en el carrito de compras y en el checkout (por ejemplo, porque no hay cobertura en el destino o por problemas técnicos), nuestra extensión puede mostrar un servicio express y un económico con costo fijo como respaldo. Al habilitar esta opción puedes asegurar que tus clientes siempre puedan seleccionar un servicio de envío y terminar su cumpra. De esta manera nunca perderas ventas.",
    "custom_design_title":"Diseño customizado",
    "default_currency":"Moneda por defecto",
    "no_dimensions_error":"Al menos un artículo en tu carrito tiene dimensiones indefinidas. Por favor define las dimensiones correspondientes a cada artículo de tu tienda o configura un empaque por defecto. Si configuras un empaque por defecto, vamos a utilizar las dimensiones de este empaque y no es necesario ingresar dimensiones para cada artículo de tu tienda.",
    "no_weight_error":"Al menos un artículo en el carrito no tiene peso configurado. Desafortunadamente, las tarifas calculadas dependen del peso de los artículos y no podemos determinar ninguna tarifa sin el. Por favor asegura ingresar el peso para cada artículo en tu tienda.",
    "configuration":"Configuración",
    "plugin_name":"Enviaya!",
    "accounts_missing_api_key":"Por favor ingresa tu API Key para poder ligar tu cuenta",
    "get_api_key":"Obtener tu clave API",
    "packagings_missing_api_key":"Por favor, introduzca su clave API para recuperar su (s) empaque (s).",
    "select_address":"Por favor, introduzca su clave API para recuperar su(s) dirección(es) de origen.",
    "yes_no":"Sí / No",
    "select_account":"Por favor selecciona una cuenta",
    "select_sender":"Por favor seleccione una dirección de origen",
    "optional":"Si administras más de una cuenta de facturación, puedes definir a cúal de tus cuentas deseas cobrar los envíos de tu tienda.",
    "enable_estimated_shipping":"Enable Estimated Shipping in Cart?",
    "enable_estimated_shipping_help":"",
    "price_display":"Price display",
    "express":"Exprés",
    "system_info":"Información del sistema",
    "save":"Guardar",
    "track":"Rastrear",
    "delete":"Eliminar",
    "see_detailed_tracking":"Ver seguimiento detallado",
    "here":"aquí",
    "est_delivery":"Entrega est.",
    "select_shipping_service":"Seleccione un servicio de envío",
    "text_shipping":"Shipping",
    "error_this_request_method_is_not_supported": "Error: Esta solicitud no está soportado.",
    "shipping_service_design_type_script":"<script> var value = document.getElementById('carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_shipping_service_design_type').selectedIndex; var f1 = document.getElementById('row_carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_display_carrier_logo'); var f2 = document.getElementById('row_carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_shipping_services_design'); var f3 = document.getElementById('row_carriers_sides_enviaya_sides_enviaya_rating_shipping_services_design_section_shipping_services_design2'); if (value == '0') { f3.style.display = 'none'; } else { f1.style.display = 'none'; f2.style.display = 'none'; } console.log(value); console.log(f1); console.log(f2); console.log(f3); </script>",
    "rating_error":"La cotización de envíos no está disponible en este momento. Favor de intentar más tarde.",
    "shipment_booking_error_missing_information":"No se puede programar el envío porque falta datos:",
    "shipment_booking_error":"No se pudo programar el envío.",
    "uninstall_warning":"¿Estás seguro que deseas desintalar la extensión?",
    "settings_saved_confirmation_message":"Se actualizó la configuración",
    "order_shipment_title":"Envíos (EnvíaYa)",
    "vat":"IVA",
    "total":"Total",
    "amount":"Subtotal",
    "no_zip_extenstion":"ZipArchive is missed. Please ask your hosting provider."
}
